alexandergrib/ESP32_temp_and_Humidity_monitor/controller/controller.ino
    const time_t now = controllerNow();
    String enriched = json;
    enriched.remove(insertAt);
    enriched += ",\"controller_unix\":";
    enriched += String(static_cast<unsigned long>(now));
    enriched += ",\"controller_time\":\"";
    enriched += formatControllerTimeIso(now);
    enriched += "\"}";
    return enriched;
}

void printPrompt() {
    Serial.print("> ");
    promptShown = true;
}

void initStatusLed() {
    pinMode(STATUS_LED_PIN, OUTPUT);
    digitalWrite(STATUS_LED_PIN, LOW);
}

void updateStatusLed() {
    const uint32_t now = millis();
    if (!statusLedOn && now - lastLedBeatAt >= STATUS_LED_PERIOD_MS) {
        statusLedOn = true;
        lastLedBeatAt = now;
        digitalWrite(STATUS_LED_PIN, HIGH);
    } else if (statusLedOn && now - lastLedBeatAt >= STATUS_LED_ON_MS) {
        statusLedOn = false;
        digitalWrite(STATUS_LED_PIN, LOW);
    }
}

bool macEquals(const uint8_t* a, const uint8_t* b) {
    return memcmp(a, b, 6) == 0;
}

void recordSniffedRssi(const uint8_t* mac, int8_t rssiDbm) {
    for (size_t i = 0; i < RSSI_CACHE_SLOTS; ++i) {
        if (!rssiSamples[i].valid || !macEquals(rssiSamples[i].mac, mac)) continue;
        memcpy(rssiSamples[i].mac, mac, sizeof(rssiSamples[i].mac));
        rssiSamples[i].rssiDbm = rssiDbm;
        rssiSamples[i].seenAtMs = millis();
        return;
    }

    RssiSample& slot = rssiSamples[nextRssiSampleSlot];
    slot.valid = true;
    memcpy(slot.mac, mac, sizeof(slot.mac));
    slot.rssiDbm = rssiDbm;
    slot.seenAtMs = millis();
    nextRssiSampleSlot = (nextRssiSampleSlot + 1) % RSSI_CACHE_SLOTS;
}

int8_t lookupSniffedRssi(const uint8_t* mac) {
    const uint32_t now = millis();
    for (size_t i = 0; i < RSSI_CACHE_SLOTS; ++i) {
        if (!rssiSamples[i].valid || !macEquals(rssiSamples[i].mac, mac)) continue;
        if (now - rssiSamples[i].seenAtMs > RSSI_CACHE_MAX_AGE_MS) continue;
        return rssiSamples[i].rssiDbm;
    }
    return 0;
}

int findNodeByMac(const uint8_t* mac) {
    for (size_t i = 0; i < MAX_NODES; ++i) {
        if (nodes[i].used && macEquals(nodes[i].mac, mac)) return static_cast<int>(i);
    }
    return -1;
}

int findNodeById(uint32_t nodeId) {
    for (size_t i = 0; i < MAX_NODES; ++i) {
        if (nodes[i].used && nodes[i].nodeId == nodeId) return static_cast<int>(i);
    }
    return -1;
}

int allocateNodeSlot() {
    for (size_t i = 0; i < MAX_NODES; ++i) {
        if (!nodes[i].used) return static_cast<int>(i);
    }
    return -1;
}

void saveNode(size_t i) {
    String base = "node" + String(i) + "_";
    prefs.putBool((base + "used").c_str(), nodes[i].used);
    prefs.putUInt((base + "id").c_str(), nodes[i].nodeId);
    prefs.putBytes((base + "mac").c_str(), nodes[i].mac, 6);
    prefs.putString((base + "name").c_str(), String(nodes[i].name));
    prefs.putUInt((base + "rpt").c_str(), normalizeReportInterval(nodes[i].reportIntervalMs));
    prefs.putUChar((base + "fwmaj").c_str(), nodes[i].fwMajor);
    prefs.putUChar((base + "fwmin").c_str(), nodes[i].fwMinor);
    prefs.putFloat((base + "toff").c_str(), nodes[i].tempOffsetC);
    prefs.putBool((base + "heat").c_str(), nodes[i].heaterEnabled);
    prefs.putUShort((base + "srhz").c_str(), nodes[i].sampleRateHz);
}

void loadNodes() {
    prefs.begin("tmon-ctrl", false);
    nextNodeId = prefs.getUInt("nextNodeId", 1);
    controllerTimeValid = prefs.getBool("timeValid", false);
    controllerBaseEpoch = static_cast<time_t>(prefs.getULong64("timeEpoch", 0));
    controllerBaseMillis = millis();
    for (size_t i = 0; i < MAX_NODES; ++i) {
        String base = "node" + String(i) + "_";
        nodes[i].used = prefs.getBool((base + "used").c_str(), false);
        if (!nodes[i].used) continue;
        nodes[i].nodeId = prefs.getUInt((base + "id").c_str(), 0);
        prefs.getBytes((base + "mac").c_str(), nodes[i].mac, 6);
        String name = prefs.getString((base + "name").c_str(), "node");
        name.toCharArray(nodes[i].name, sizeof(nodes[i].name));
        nodes[i].reportIntervalMs = normalizeReportInterval(prefs.getUInt((base + "rpt").c_str(), DEFAULT_REPORT_MS));
        nodes[i].fwMajor = prefs.getUChar((base + "fwmaj").c_str(), 0);
        nodes[i].fwMinor = prefs.getUChar((base + "fwmin").c_str(), 0);
        nodes[i].tempOffsetC = prefs.getFloat((base + "toff").c_str(), 0.0f);
        nodes[i].heaterEnabled = prefs.getBool((base + "heat").c_str(), false);
        nodes[i].sampleRateHz = normalizeSampleRateHz(prefs.getUShort((base + "srhz").c_str(), DEFAULT_SAMPLE_RATE_HZ));
    }
}

void printJsonEvent(const String& json, bool force = false) {
    if (!force && !streamEnabled) return;
    Serial.println(withControllerTime(json));
}

bool ensurePeer(const uint8_t* mac) {
    if (esp_now_is_peer_exist(mac)) return true;
    esp_now_peer_info_t peer{};
    memcpy(peer.peer_addr, mac, 6);
    peer.channel = RADIO_CHANNEL;
    peer.encrypt = false;
    return esp_now_add_peer(&peer) == ESP_OK;
}

void sendBindAck(const uint8_t* mac, const NodeRecord& node) {
    BindAck ack{};
    fillHeader(ack.header, MSG_BIND_ACK, txSeq++, node.nodeId, millis());
    ack.assignedNodeId = node.nodeId;
    ack.reportIntervalMs = normalizeReportInterval(node.reportIntervalMs);
    ack.tempOffsetC = node.tempOffsetC;
    ack.heaterEnabled = node.heaterEnabled ? 1 : 0;
    ack.sampleRateHz = normalizeSampleRateHz(node.sampleRateHz);
    WiFi.macAddress(ack.controllerMac);
    ack.accepted = 1;
    ensurePeer(mac);
    esp_now_send(mac, reinterpret_cast<const uint8_t*>(&ack), sizeof(ack));
}

void sendConfig(uint32_t nodeId, uint32_t reportIntervalMs, float tempOffsetC, bool heaterEnabled, uint16_t sampleRateHz) {
    int idx = findNodeById(nodeId);
    if (idx < 0) return;
    ConfigSet cfg{};
    fillHeader(cfg.header, MSG_CONFIG_SET, txSeq++, nodeId, millis());
    cfg.reportIntervalMs = normalizeReportInterval(reportIntervalMs);
    cfg.tempOffsetC = tempOffsetC;
    cfg.heaterEnabled = heaterEnabled ? 1 : 0;
    cfg.sampleRateHz = normalizeSampleRateHz(sampleRateHz);
    ensurePeer(nodes[idx].mac);
    esp_now_send(nodes[idx].mac, reinterpret_cast<const uint8_t*>(&cfg), sizeof(cfg));
}

void sendRename(uint32_t nodeId, const String& requestedName) {
    int idx = findNodeById(nodeId);
    if (idx < 0) return;

    const String sanitizedName = sanitizeNodeName(requestedName);
    RenameSet msg{};
    fillHeader(msg.header, MSG_RENAME_SET, txSeq++, nodeId, millis());
    sanitizedName.toCharArray(msg.nodeName, sizeof(msg.nodeName));
    ensurePeer(nodes[idx].mac);
    esp_now_send(nodes[idx].mac, reinterpret_cast<const uint8_t*>(&msg), sizeof(msg));
}

