alexandergrib/ESP32_temp_and_Humidity_monitor/controller/controller.ino
    const String sanitizedName = sanitizeNodeName(String(ack.nodeName));
    if (ack.applied) {
        sanitizedName.toCharArray(nodes[idx].name, sizeof(nodes[idx].name));
        nodes[idx].lastSeenMs = millis();
        saveNode(static_cast<size_t>(idx));
    }

    printJsonEvent(
        "{\"event\":\"rename_ack\",\"node_id\":" + String(nodes[idx].nodeId) +
        ",\"name\":\"" + sanitizedName +
        "\",\"applied\":" + String(ack.applied ? "true" : "false") + "}",
        true
    );
}

void handleOtaAck(const uint8_t* mac, const OtaAck& ack) {
    if (!otaSession.active || !macEquals(mac, otaSession.mac)) return;

    otaSession.awaitingAck = false;
    otaSession.bytesReceived = ack.bytesReceived;

    printJsonEvent(
        "{\"event\":\"ota_ack\",\"node_id\":" + String(otaSession.nodeId) +
        ",\"phase\":" + String(ack.phase) +
        ",\"status\":\"" + String(otaStatusToString(ack.status)) +
        "\",\"bytes_received\":" + String(ack.bytesReceived) +
        ",\"detail\":" + String(ack.detail) + "}"
    );

    if (ack.phase == OTA_PHASE_BEGIN && ack.status == OTA_STATUS_BUSY) {
        otaSession.awaitingAck = false;
        otaSession.nextOffset = ack.bytesReceived;
        otaSession.bytesReceived = ack.bytesReceived;
        return;
    }

    if (ack.status != OTA_STATUS_OK) {
        if (ack.status == OTA_STATUS_OFFSET_MISMATCH) {
            otaSession.nextOffset = ack.bytesReceived;
            return;
        }
        if (ack.phase == OTA_PHASE_BEGIN) {
            clearOtaSession();
        }
        if (ack.phase == OTA_PHASE_END) {
            clearOtaSession();
        }
        return;
    }

    switch (ack.phase) {
        case OTA_PHASE_BEGIN:
            otaSession.nextOffset = ack.bytesReceived;
            break;
        case OTA_PHASE_CHUNK:
            otaSession.nextOffset = ack.bytesReceived;
            break;
        case OTA_PHASE_END:
            printJsonEvent(
                "{\"event\":\"ota_complete\",\"node_id\":" + String(otaSession.nodeId) +
                ",\"bytes\":" + String(ack.bytesReceived) + "}"
            );
            clearOtaSession();
            break;
    }
}

void handleIncomingPacket(const uint8_t* mac, const uint8_t* data, int len, int8_t rssiDbm) {
    if (len < static_cast<int>(sizeof(Header))) return;
    if (rssiDbm == 0) {
        rssiDbm = lookupSniffedRssi(mac);
    }
    const Header* h = reinterpret_cast<const Header*>(data);
    if (!validHeader(*h)) return;

    switch (h->type) {
        case MSG_BIND_REQUEST:
            if (len == sizeof(BindRequest)) handleBindRequest(mac, *reinterpret_cast<const BindRequest*>(data));
            break;
        case MSG_READING:
            if (len == sizeof(Reading)) handleReading(mac, *reinterpret_cast<const Reading*>(data), rssiDbm);
            break;
        case MSG_CONFIG_ACK:
            if (len == sizeof(ConfigAck)) handleConfigAck(mac, *reinterpret_cast<const ConfigAck*>(data));
            break;
        case MSG_RENAME_ACK:
            if (len == sizeof(RenameAck)) handleRenameAck(mac, *reinterpret_cast<const RenameAck*>(data));
            break;
        case MSG_OTA_ACK:
            if (len == sizeof(OtaAck)) handleOtaAck(mac, *reinterpret_cast<const OtaAck*>(data));
            break;
        default:
            break;
    }
}

void logSendStatus(esp_now_send_status_t status) {
    if (status != ESP_NOW_SEND_SUCCESS) {
        printJsonEvent(String("{\"event\":\"tx_status\",\"ok\":false}"), true);
    }
}

void onPromiscuousPacket(void* buf, wifi_promiscuous_pkt_type_t type) {
    if (type != WIFI_PKT_MGMT || buf == nullptr) return;

    const auto* pkt = static_cast<const wifi_promiscuous_pkt_t*>(buf);
    const uint8_t* frame = pkt->payload;
    const uint16_t len = pkt->rx_ctrl.sig_len;

    if (len < 39) return;
    if (frame[24] != ESPNOW_CATEGORY_CODE) return;
    if (memcmp(frame + 25, ESPRESSIF_OUI, sizeof(ESPRESSIF_OUI)) != 0) return;
    if (frame[32] != ESPNOW_ELEMENT_ID) return;
    if (memcmp(frame + 34, ESPRESSIF_OUI, sizeof(ESPRESSIF_OUI)) != 0) return;
    if (frame[37] != ESPNOW_TYPE) return;

    recordSniffedRssi(frame + 10, pkt->rx_ctrl.rssi);
}

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void onDataRecv(const esp_now_recv_info_t* recvInfo, const uint8_t* data, int len) {
    const int8_t rssiDbm =
        (recvInfo != nullptr && recvInfo->rx_ctrl != nullptr) ? recvInfo->rx_ctrl->rssi : 0;
    handleIncomingPacket(recvInfo->src_addr, data, len, rssiDbm);
}

void onDataSent(const wifi_tx_info_t*, esp_now_send_status_t status) {
    logSendStatus(status);
}
#else
void onDataRecv(const uint8_t* mac, const uint8_t* data, int len) {
    handleIncomingPacket(mac, data, len, 0);
}

void onDataSent(const uint8_t*, esp_now_send_status_t status) {
    logSendStatus(status);
}
#endif

void openBindWindow(uint32_t durationMs = BIND_WINDOW_MS) {
    bindWindowOpen = true;
    bindWindowEndsAt = millis() + durationMs;
    printJsonEvent(String("{\"event\":\"bind_window\",\"open\":true,\"duration_ms\":") + durationMs + "}");
}

void listNodes() {
    Serial.println("{\"event\":\"nodes\",\"items\":[");
    bool first = true;
    for (size_t i = 0; i < MAX_NODES; ++i) {
        if (!nodes[i].used) continue;
        if (!first) Serial.println(",");
        first = false;
        Serial.print("{\"node_id\":"); Serial.print(nodes[i].nodeId);
        Serial.print(",\"name\":\""); Serial.print(nodes[i].name);
        Serial.print("\",\"mac\":\""); Serial.print(macToString(nodes[i].mac));
        Serial.print("\",\"last_seen_ms\":"); Serial.print(nodes[i].lastSeenMs);
        Serial.print(",\"report_interval_ms\":"); Serial.print(nodes[i].reportIntervalMs);
        Serial.print(",\"fw_version\":\""); Serial.print(nodes[i].fwMajor); Serial.print("."); Serial.print(nodes[i].fwMinor); Serial.print("\"");
        Serial.print(",\"rssi_dbm\":"); Serial.print(nodes[i].lastRssiDbm);
        Serial.print(",\"signal_pct\":"); Serial.print(rssiToSignalPercent(nodes[i].lastRssiDbm));
        Serial.print(",\"temp_offset_c\":"); Serial.print(nodes[i].tempOffsetC, 2);
        Serial.print(",\"heater_enabled\":"); Serial.print(nodes[i].heaterEnabled ? "true" : "false");
        Serial.print(",\"sample_rate_hz\":"); Serial.print(nodes[i].sampleRateHz);
        Serial.print(",\"next_poll_in_ms\":"); Serial.print(static_cast<int32_t>(nodes[i].nextPollDueAtMs - millis()));
        Serial.print("}");
    }
    Serial.println("]}");
}

int hexNibble(char c) {
    if (c >= '0' && c <= '9') return c - '0';
    if (c >= 'a' && c <= 'f') return 10 + (c - 'a');
    if (c >= 'A' && c <= 'F') return 10 + (c - 'A');
    return -1;
}

bool decodeHexPayload(const String& hex, uint8_t* out, uint16_t& outLen) {
    if ((hex.length() % 2) != 0) return false;
    const size_t bytes = hex.length() / 2;
    if (bytes == 0 || bytes > OTA_CHUNK_BYTES) return false;

    for (size_t i = 0; i < bytes; ++i) {
        int hi = hexNibble(hex[2 * i]);
        int lo = hexNibble(hex[2 * i + 1]);
        if (hi < 0 || lo < 0) return false;
        out[i] = static_cast<uint8_t>((hi << 4) | lo);
    }
    outLen = static_cast<uint16_t>(bytes);
    return true;
}

