alexandergrib/ESP32_temp_and_Humidity_monitor/controller/controller.ino
void processSerialCommand(const String& raw) {
    String cmd = raw;
    cmd.trim();
    promptShown = false;
    if (cmd.equalsIgnoreCase("HELP")) {
        Serial.println("Commands: HELP, NODES, BIND, BIND OFF, SETINT <nodeId> <ms>, SETINT ALL <ms>, SETSAMPLE <nodeId> <hz>, SETSAMPLE ALL <hz>, SETTOFF <nodeId> <tempOffsetC>, HEATER <nodeId> ON|OFF, RENAME <nodeId> <name>, STREAM OFF, STREAM ON, TIME STATUS, TIME SET <unixSeconds>, OTA BEGIN <nodeId> <size> <crc32hex>, OTA CHUNK <offset> <hex>, OTA END, OTA STATUS, OTA ABORT");
    } else if (cmd.equalsIgnoreCase("NODES")) {
        listNodes();
    } else if (cmd.equalsIgnoreCase("BIND")) {
        openBindWindow();
    } else if (cmd.equalsIgnoreCase("BIND OFF")) {
        bindWindowOpen = false;
        Serial.println("{\"event\":\"bind_window\",\"open\":false}");
    } else if (cmd.equalsIgnoreCase("STREAM OFF")) {
        streamEnabled = false;
        printJsonEvent("{\"event\":\"stream\",\"enabled\":false}", true);
    } else if (cmd.equalsIgnoreCase("STREAM ON")) {
        streamEnabled = true;
        printJsonEvent("{\"event\":\"stream\",\"enabled\":true}", true);
    } else if (cmd.equalsIgnoreCase("TIME STATUS")) {
        if (controllerTimeValid) {
            const time_t now = controllerNow();
            printJsonEvent(
                "{\"event\":\"time_status\",\"valid\":true,\"unix\":" +
                String(static_cast<unsigned long>(now)) +
                ",\"iso\":\"" + formatControllerTimeIso(now) + "\"}",
                true
            );
        } else {
            printJsonEvent("{\"event\":\"time_status\",\"valid\":false}", true);
        }
    } else if (cmd.startsWith("TIME SET ")) {
        const time_t epochSeconds = static_cast<time_t>(strtoul(cmd.substring(9).c_str(), nullptr, 10));
        if (epochSeconds == 0) {
            printJsonEvent("{\"event\":\"time_error\",\"reason\":\"invalid_epoch\"}", true);
        } else {
            setControllerTime(epochSeconds);
            const time_t now = controllerNow();
            printJsonEvent(
                "{\"event\":\"time_set\",\"unix\":" +
                String(static_cast<unsigned long>(now)) +
                ",\"iso\":\"" + formatControllerTimeIso(now) + "\"}",
                true
            );
        }
    } else if (cmd.startsWith("SETINT ")) {
        if (cmd.startsWith("SETINT ALL ")) {
            uint32_t ms = cmd.substring(11).toInt();
            uint32_t appliedCount = 0;
            for (size_t i = 0; i < MAX_NODES; ++i) {
                if (!nodes[i].used) continue;
                sendConfig(nodes[i].nodeId, ms, nodes[i].tempOffsetC, nodes[i].heaterEnabled, nodes[i].sampleRateHz);
                appliedCount++;
            }
            printJsonEvent(
                "{\"event\":\"setint_all\",\"report_interval_ms\":" + String(ms) +
                ",\"targets\":" + String(appliedCount) + "}",
                true
            );
        } else {
            int sp = cmd.indexOf(' ', 7);
            if (sp > 0) {
                uint32_t nodeId = cmd.substring(7, sp).toInt();
                uint32_t ms = cmd.substring(sp + 1).toInt();
                int idx = findNodeById(nodeId);
                if (idx >= 0) sendConfig(nodeId, ms, nodes[idx].tempOffsetC, nodes[idx].heaterEnabled, nodes[idx].sampleRateHz);
            }
        }
    } else if (cmd.startsWith("SETSAMPLE ")) {
        if (cmd.startsWith("SETSAMPLE ALL ")) {
            uint16_t hz = normalizeSampleRateHz(cmd.substring(14).toInt());
            uint32_t appliedCount = 0;
            for (size_t i = 0; i < MAX_NODES; ++i) {
                if (!nodes[i].used) continue;
                nodes[i].sampleRateHz = hz;
                saveNode(i);
                sendConfig(nodes[i].nodeId, nodes[i].reportIntervalMs, nodes[i].tempOffsetC, nodes[i].heaterEnabled, nodes[i].sampleRateHz);
                appliedCount++;
            }
            printJsonEvent(
                "{\"event\":\"setsample_all\",\"sample_rate_hz\":" + String(hz) +
                ",\"targets\":" + String(appliedCount) + "}",
                true
            );
        } else {
            int sp = cmd.indexOf(' ', 10);
            if (sp > 0) {
                uint32_t nodeId = cmd.substring(10, sp).toInt();
                uint16_t hz = normalizeSampleRateHz(cmd.substring(sp + 1).toInt());
                int idx = findNodeById(nodeId);
                if (idx >= 0) {
                    nodes[idx].sampleRateHz = hz;
                    saveNode(static_cast<size_t>(idx));
                    sendConfig(nodeId, nodes[idx].reportIntervalMs, nodes[idx].tempOffsetC, nodes[idx].heaterEnabled, nodes[idx].sampleRateHz);
                }
            }
        }
    } else if (cmd.startsWith("SETTOFF ")) {
        int sp = cmd.indexOf(' ', 8);
        if (sp > 0) {
            uint32_t nodeId = cmd.substring(8, sp).toInt();
            float offsetC = cmd.substring(sp + 1).toFloat();
            int idx = findNodeById(nodeId);
            if (idx >= 0) {
                nodes[idx].tempOffsetC = offsetC;
                saveNode(static_cast<size_t>(idx));
                sendConfig(nodeId, nodes[idx].reportIntervalMs, nodes[idx].tempOffsetC, nodes[idx].heaterEnabled, nodes[idx].sampleRateHz);
            }
        }
    } else if (cmd.startsWith("HEATER ")) {
        int sp = cmd.indexOf(' ', 7);
        if (sp > 0) {
            uint32_t nodeId = cmd.substring(7, sp).toInt();
            String value = cmd.substring(sp + 1);
            value.trim();
            int idx = findNodeById(nodeId);
            if (idx >= 0) {
                if (value.equalsIgnoreCase("ON")) {
                    nodes[idx].heaterEnabled = true;
                } else if (value.equalsIgnoreCase("OFF")) {
                    nodes[idx].heaterEnabled = false;
                } else {
                    printJsonEvent("{\"event\":\"heater_error\",\"reason\":\"invalid_value\"}", true);
                    printPrompt();
                    return;
                }
                saveNode(static_cast<size_t>(idx));
                sendConfig(nodeId, nodes[idx].reportIntervalMs, nodes[idx].tempOffsetC, nodes[idx].heaterEnabled, nodes[idx].sampleRateHz);
            }
        }
    } else if (cmd.startsWith("RENAME ")) {
        int sp = cmd.indexOf(' ', 7);
        if (sp > 0) {
            uint32_t nodeId = cmd.substring(7, sp).toInt();
            const String name = sanitizeNodeName(cmd.substring(sp + 1));
            int idx = findNodeById(nodeId);
            if (idx >= 0) {
                sendRename(nodeId, name);
                printJsonEvent(
                    "{\"event\":\"rename_sent\",\"node_id\":" + String(nodeId) +
                    ",\"name\":\"" + name + "\"}",
                    true
                );
            }
        }
    } else if (cmd.equalsIgnoreCase("OTA STATUS")) {
        printJsonEvent(
            "{\"event\":\"ota_status\",\"active\":" + String(otaSession.active ? "true" : "false") +
            ",\"awaiting_ack\":" + String(otaSession.awaitingAck ? "true" : "false") +
            ",\"node_id\":" + String(otaSession.nodeId) +
            ",\"next_offset\":" + String(otaSession.nextOffset) +
            ",\"bytes_received\":" + String(otaSession.bytesReceived) + "}"
        );
    } else if (cmd.equalsIgnoreCase("OTA ABORT")) {
        abortOta("host_request");
    } else if (cmd.startsWith("OTA BEGIN ")) {
        int sp1 = cmd.indexOf(' ', 10);
        int sp2 = sp1 > 0 ? cmd.indexOf(' ', sp1 + 1) : -1;
        if (sp1 > 0 && sp2 > 0) {
            uint32_t nodeId = cmd.substring(10, sp1).toInt();
            uint32_t totalSize = cmd.substring(sp1 + 1, sp2).toInt();
            uint32_t expectedCrc32 = strtoul(cmd.substring(sp2 + 1).c_str(), nullptr, 16);
            if (!beginOta(nodeId, totalSize, expectedCrc32)) {
                printJsonEvent("{\"event\":\"ota_error\",\"reason\":\"begin_rejected\"}");
            }
        }
    } else if (cmd.startsWith("OTA CHUNK ")) {
        int sp1 = cmd.indexOf(' ', 10);
        if (sp1 > 0) {
            uint32_t offset = cmd.substring(10, sp1).toInt();
            String hex = cmd.substring(sp1 + 1);
            uint8_t data[OTA_CHUNK_BYTES];
            uint16_t len = 0;
            if (!decodeHexPayload(hex, data, len)) {
                printJsonEvent("{\"event\":\"ota_error\",\"reason\":\"invalid_hex\"}");
                return;
            }
            if (!queueOtaChunk(offset, data, len)) {
                printJsonEvent(
                    "{\"event\":\"ota_error\",\"reason\":\"chunk_rejected\",\"expected_offset\":" +
                    String(otaSession.nextOffset) + "}"
                );
            }
        }
    } else if (cmd.equalsIgnoreCase("OTA END")) {
        if (!finishOta()) {
            printJsonEvent("{\"event\":\"ota_error\",\"reason\":\"end_rejected\"}");
        }
    }
    if (!cmd.startsWith("OTA CHUNK ")) {
        printPrompt();
    }
}

void setup() {
    Serial.begin(SERIAL_BAUD);
    delay(500);
    initStatusLed();

    loadNodes();
    rebuildPollSchedule();

    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    esp_wifi_set_promiscuous(true);
    esp_wifi_set_channel(RADIO_CHANNEL, WIFI_SECOND_CHAN_NONE);
    wifi_promiscuous_filter_t filter{};
    filter.filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT;
    esp_wifi_set_promiscuous_filter(&filter);
    esp_wifi_set_promiscuous_rx_cb(onPromiscuousPacket);

    if (esp_now_init() != ESP_OK) {
        Serial.println("{\"event\":\"fatal\",\"reason\":\"esp_now_init_failed\"}");
        return;
    }

    esp_now_register_recv_cb(onDataRecv);
    esp_now_register_send_cb(onDataSent);

    uint8_t broadcastMac[] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
    ensurePeer(broadcastMac);

    openBindWindow();
    Serial.println("{\"event\":\"controller_ready\",\"channel\":6}");
    printPrompt();
}

void loop() {
    static String line;
    updateStatusLed();

    while (Serial.available()) {
        char c = static_cast<char>(Serial.read());
        if (c == '\n' || c == '\r') {
            if (!line.isEmpty()) {
                processSerialCommand(line);
            } else if (!promptShown) {
                printPrompt();
            }
            line = "";
        } else if (c == '\b' || c == 127) {
            if (!line.isEmpty()) {
                line.remove(line.length() - 1);
            }
        } else {
            line += c;
        }
    }

    if (bindWindowOpen && millis() > bindWindowEndsAt) {
        bindWindowOpen = false;
        Serial.println("{\"event\":\"bind_window\",\"open\":false}");
    }

    pollSatellites();

    if (otaSession.active && otaSession.awaitingAck && timeReached(millis(), otaSession.ackDeadlineMs)) {
        if (otaSession.retryCount >= OTA_MAX_RETRIES) {
            abortOta("ack_timeout");
        } else {
            retryPendingOtaFrame();
        }
    }
}
